Команды GitHub

1)  git init --> создание папки .git
2)  git remote -v --> проверка подключения
3)  git status --> проверка и наблюдение за файлами (отслеживаемые, неотслеживаемые)
4)  git remote add origin 'ссылка' --> это команда соединяет удаленный репозиторий 
5)  git add 'название файла' или *(*-всё) --> добавление для отслеживания 
6)  git commit -m 'короткая информация о файле' --> сохраняет Состояние объекта
7)  git push -u origin branch_name --> отправка на git
8)  git log --> просмотр коммитов
9)  git branch --> проверка ветки
10) git branch 'название ветки' --> создание новых веток
11) git branch -d 'название ветки' --> удаление веток
12) git checkout 'название ветки' --> переход с одной ветки на другую
13) git switch 'название ветки' --> переход с одной ветки на другую (новая версия)
14) git clone 'ссылка' --> создание копии с удаленки себе на пк
15) git checkout -b 'название ветки' --> создания ветки и переход
16) git pull --> скачивает разницу между удаленки и пк 
17) git push origin 'название ветки' --> загрузка данных на указанный адресс
18) git push --> загрузка данных по умолчанию (main или master)
19) git push origin -f 'название ветки' --> загрузка данных на указанный адресс не смотря на ошибки
20) git config --global user.name 'гитхабдагы атынды'
21) git config --global user.email 'гитхабдагы почтаны'
